Problem Statement : Hospital Patient Data Analysis
- Context:
- A hospital maintains patient records including admission details, department, diagnosis, doctor, and bill amount. You have two datasets: one with patient info and another with billing details. Some patients have blank bill amounts, and there are multiple rows for the same patient due to follow-ups.

In [2]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv("Patient_Data.csv")
df

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45
5,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 468.0+ bytes

2.	Select only the columns relevant for billing: ['PatientID', 'Department', 'Doctor', 'BillAmount'].

In [8]:
billing_data = df[['PatientID', 'Department', 'Doctor', 'BillAmount']]
billing_data

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

3.	Drop administrative columns like ['ReceptionistID', 'CheckInTime'].

In [10]:
df = df.drop(['ReceptionistID', 'CheckInTime'], axis=1)
df

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

4.	Use groupby to find total bill amount per department.

In [12]:
total_bill = df.groupby('Department')['BillAmount'].sum()
total_bill

Department
Cardiology     16200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

5.	Remove duplicate patient records based on PatientID.

In [14]:
df = df.drop_duplicates(subset='PatientID')
df

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN

6.	Fill missing BillAmount values with the mean bill amount.

In [15]:
df.loc[:,'BillAmount'] = df['BillAmount'].fillna(df['BillAmount'].mean())
df

   PatientID     Name   Department     Doctor   BillAmount
0        101    Alice   Cardiology  Dr. Smith  5000.000000
1        102      Bob    Neurology   Dr. John  6233.333333
2        103  Charlie  Orthopedics    Dr. Lee  7500.000000
3        104    David   Cardiology  Dr. Smith  6200.000000
4        105      Eva  Dermatology   Dr. Rose  6233.333333

7.	Merge the billing dataset with patient dataset on PatientID.

In [16]:
billing_data = pd.read_csv('Billing_Data.csv')
billing_data

   PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500
2        103              2500         5000
3        104              3000         3200
4        105              1000         4000

In [24]:
merged_df = pd.merge(patient_df, billing_df, on="PatientID", how="inner")
merged_df

,PatientID,Name_x,Department_x,Doctor_x,BillAmount_x,Name_y,Department_y,Doctor_y,BillAmount_y
0,101,Alice,Cardiology,Dr. Smith,5000.000000,Alice,Cardiology,Dr. Smith,5000.000000
1,102,Bob,Neurology,Dr. John,6233.333333,Bob,Neurology,Dr. John,6233.333333
2,103,Charlie,Orthopedics,Dr. Lee,7500.000000,Charlie,Orthopedics,Dr. Lee,7500.000000
3,104,David,Cardiology,Dr. Smith,6200.000000,David,Cardiology,Dr. Smith,6200.000000
4,105,Eva,Dermatology,Dr. Rose,6233.333333,Eva,Dermatology,Dr. Rose,6233.333333

8.	Concatenate an additional DataFrame that contains new patients for the current week (row-wise).

In [21]:
patient_df = df

In [26]:
new_patients_df = pd.DataFrame({
    'PatientID': [106, 107],
    'Name': ['Sukhada', 'Shweta'],
    'Age': [21, 25],
    'Department': ['Dermatology', 'Neurology'],
    'Doctor': ['Dr. Kulkarni', 'Dr. Pande'],
    'BillAmount': [2000, 4000],
    'ReceptionistID': [11, 12],
    'CheckInTime': ['2025-06-11 08:00', '2025-06-11 11:15']
})

In [27]:
updated_df = pd.concat([patient_df, new_patients_df], axis=0, ignore_index=True)
updated_df

,PatientID,Name,Department,Doctor,BillAmount,Age,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.000000,NaN,NaN,NaN
1,102,Bob,Neurology,Dr. John,6233.333333,NaN,NaN,NaN
2,103,Charlie,Orthopedics,Dr. Lee,7500.000000,NaN,NaN,NaN
3,104,David,Cardiology,Dr. Smith,6200.000000,NaN,NaN,NaN
4,105,Eva,Dermatology,Dr. Rose,6233.333333,NaN,NaN,NaN
5,106,Sukhada,Dermatology,Dr. Kulkarni,2000.000000,21.0,11.0,2025-06-11 08:00
6,107,Shweta,Neurology,Dr. Pande,4000.000000,25.0,12.0,2025-06-11 11:15

9.	Concatenate new billing category columns like ['InsuranceCovered', 'FinalAmount'] (column-wise).

In [28]:
billing_df = df

In [29]:
billing_df.columns

Index(['PatientID', 'Name', 'Department', 'Doctor', 'BillAmount'], dtype='object')

In [37]:
new_billing_cols = pd.DataFrame({
    'InsuranceCovered': [True] * len(billing_df),
    'FinalAmount': billing_df['BillAmount'] * 0.8
})
new_billing_cols

   InsuranceCovered  FinalAmount
0              True  4000.000000
1              True  4986.666667
2              True  6000.000000
3              True  4960.000000
4              True  4986.666667

In [38]:
updated_billing_df = pd.concat([billing_df, new_billing_cols], axis=1)
updated_billing_df

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.000000,True,4000.000000
1,102,Bob,Neurology,Dr. John,6233.333333,True,4986.666667
2,103,Charlie,Orthopedics,Dr. Lee,7500.000000,True,6000.000000
3,104,David,Cardiology,Dr. Smith,6200.000000,True,4960.000000
4,105,Eva,Dermatology,Dr. Rose,6233.333333,True,4986.666667